pastebin/e2e/taurus.yml
---
settings:
  env:
    BASE_URL: 192.168.99.100

execution:
  - concurrency: 10
    hold-for: 5m
    # ramp-up: 40s
    scenario: paste-read-test
scenarios:
  paste-read-test:
    store-cache: true
    requests:
      - label: paste-read
        method: GET
        url: http://${BASE_URL}/v1/paste/${uuid}
        headers:
          ApiKey: cafebabe
    data-sources:
      - path: uuid.csv   # this is a full form
        delimiter: ','
        quoted: true
        encoding: "utf-8"
        loop: true
        variable-names: uuid
        random-order: true
    modifications:
      set-prop:  # Set element properties, selected as [Element Name]>[property name]
        "Cache>clearEachIteration": false
        "Cache>useExpires": false
        "Cache>TestPlan.comments": "Changed cache configs."


modules:
  jmeter:
    gui: false